
* 2022
** 2022-04 April
*** 2022-04-19 Tuesday

**** 09:05 AM - Journal                                          :journal:
:LOGBOOK:
CLOCK: [2022-04-19 Tue 09:05]--[2022-04-19 Tue 09:05] =>  0:00
:END:

Today was a great day! Learning more about org mode. 



** 2022-05 May
*** 2022-05-09 Monday

**** 07:41 AM - Journal                                          :journal:
:LOGBOOK:
CLOCK: [2022-05-09 Mon 07:41]--[2022-05-09 Mon 07:48] =>  0:07
:END:

*This is a journal entry*

Trying to get used to the Journal for org-mode. I'm not sure what I want to put here though. I think I need to setup a new file "devlog" for development notes on my projects. I need to focus this week on finishing out flexbox and my project. For diet I need to fast. We have a lot of busy times coming up this week. This journal is even an attempt at bringing back and restarting some habits. No matter how short. I need to make a journal entry every day
*** 2022-05-30 Monday

**** 11:19 AM - Journal                                          :journal:
:LOGBOOK:
CLOCK: [2022-05-30 Mon 11:19]--[2022-05-30 Mon 11:21] =>  0:02
:END:

**** 11:21 AM - Journal                  :journal:devlog:odin:foundations:
:LOGBOOK:
CLOCK: [2022-05-30 Mon 11:21]--[2022-05-30 Mon 11:22] =>  0:01
:END:

Today's journal entry. I need to be using this more. Especially for "dev" work and logs.

** 2022-07 July

*** 2022-07-24 Sunday

** 2022-08 August

*** 2022-08-09 Tuesday

**** 09:34 AM - Journal                                          :journal:
:LOGBOOK:
CLOCK: [2022-08-09 Tue 09:34]--[2022-08-09 Tue 09:38] =>  0:04
:END:

This is a new journal entry.

** 2022-11 November

*** 2022-11-24 Thursday

*** 2022-11-26 Saturday

**** 02:57 pm - Meeting on thing                                :meetings:
:LOGBOOK:
CLOCK: [2022-11-26 Sat 14:57]--[2022-11-26 Sat 14:57] =>  0:00
:END:

Test meeting notes. Lets just add this here

**** Checking Email                                                :email:

Test this out. 

**** 05:49 pm - [[file:~/Projects/odin-library/index.html::</thead>]] :meetings:
:LOGBOOK:
CLOCK: [2022-11-26 Sat 17:49]--[2022-11-26 Sat 17:49] =>  0:00
:END:

**** 05:49 PM - Journal                                          :journal:
:LOGBOOK:
CLOCK: [2022-11-26 Sat 17:49]--[2022-11-26 Sat 17:49] =>  0:00
:END:

**

**** 05:49 PM - Journal                                          :journal:
:LOGBOOK:
CLOCK: [2022-11-26 Sat 17:49]--[2022-11-26 Sat 17:50] =>  0:01
:END:

**** 05:50 pm - [[file:~/Projects/odin-library/index.html::</caption>]] :meetings:
:LOGBOOK:
CLOCK: [2022-11-26 Sat 17:50]--[2022-11-26 Sat 17:51] =>  0:01
:END:

This is a note.

** 2022-12 December

*** 2022-12-04 Sunday
